ERM/src/Documents/PenaltyCalculation/PenaltyCalculation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PenaltyCalculation</name>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Calculation</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntiites</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Client</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.Invoice</types>
      </type>
    </attributes>
    <attributes>
      <name>DueDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>PenaltyDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RemainingAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RemainingAmountUSD</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OverdueDays</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PenaltyAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IsProblem</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERM/src/Documents/BillingCalculation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>BillingCalculation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Billing</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CreatedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModifiedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LawsonBilling</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LegalEntity</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>USDAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>HOBBilling</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LegalEntity</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>InitialAR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FinalAR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Collection</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>USDAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/Documents/PenaltyCalculation/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Calculation.Количество() > 0 Тогда
	
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "The document is filled. If you continue, the data will be lost. Continue?", РежимДиалогаВопрос.ДаНет, 10);
		
	Иначе
		
		ЗаполнитьДанныеПоШтрафамНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеПоШтрафамНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоШтрафамНаКлиенте()
	
	Результат = ЗаполнитьДанныеПоШтрафамНаСервере();
	
	Если НЕ Результат.ЗаданиеВыполнено Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
	//Иначе
	//	Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеПоШтрафамНаСервере()
	
	СтруктураПараметров = Новый Структура("Ссылка");
	СтруктураПараметров.Вставить("Ссылка", Объект.Ссылка);
	СтруктураПараметров.Вставить("ПериодРасчета", Объект.Дата);
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		Документы.PenaltyCalculation.ЗаполнитьДанныеПоШтрафам(СтруктураПараметров, АдресХранилища);
		
		Результат = Новый Структура("ЗаданиеВыполнено", Истина);
	Иначе
		НаименованиеЗадания = НСтр("ru = 'Заполнение данные по биллингу'");
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор, 
			"Документы.BillingCalculation.ЗаполнитьДанныеПоБиллингу", 
			СтруктураПараметров, 
			НаименованиеЗадания);
			
		АдресХранилища = Результат.АдресХранилища;
	КонецЕсли;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("ОшибкаЗаполнения") Тогда
		ВызватьИсключение СтруктураДанных.ОшибкаЗаполнения;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ManualAdjustment", Истина);
	LawsonBilling_ManualAdjustments = Объект.LawsonBilling.Выгрузить(СтруктураОтбора);
	HOBBilling_ManualAdjustments = Объект.HOBBilling.Выгрузить(СтруктураОтбора);
	OracleMIBilling_ManualAdjustments = Объект.OracleMIBilling.Выгрузить(СтруктураОтбора);
	OracleSmithBilling_ManualAdjustments = Объект.OracleSmithBilling.Выгрузить(СтруктураОтбора);
	RadiusBilling_ManualAdjustments = Объект.RadiusBilling.Выгрузить(СтруктураОтбора);
	
	Объект.LawsonBilling.Очистить();
	Объект.HOBBilling.Очистить();
	Объект.OracleMIBilling.Очистить();
	Объект.OracleSmithBilling.Очистить();
	Объект.RadiusBilling.Очистить();
	
	Если СтруктураДанных.Свойство("ДанныеПоБиллингу") Тогда
		Объект.LawsonBilling.Загрузить(СтруктураДанных.ДанныеПоБиллингу.LawsonBilling);
		Объект.HOBBilling.Загрузить(СтруктураДанных.ДанныеПоБиллингу.HOBBilling);
		Объект.OracleMIBilling.Загрузить(СтруктураДанных.ДанныеПоБиллингу.OracleMIBilling);
		Объект.OracleSmithBilling.Загрузить(СтруктураДанных.ДанныеПоБиллингу.OracleSmithBilling);
		Объект.RadiusBilling.Загрузить(СтруктураДанных.ДанныеПоБиллингу.RadiusBilling);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(LawsonBilling_ManualAdjustments, Объект.LawsonBilling);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(HOBBilling_ManualAdjustments, Объект.HOBBilling);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(OracleMIBilling_ManualAdjustments, Объект.OracleMIBilling);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(OracleSmithBilling_ManualAdjustments, Объект.OracleSmithBilling);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(RadiusBilling_ManualAdjustments, Объект.RadiusBilling);
	
	Элементы.LawsonBilling.Обновить();
	Элементы.HOBBilling.Обновить();
	Элементы.OracleMIBilling.Обновить();
	Элементы.OracleSmithBilling.Обновить();
	Элементы.RadiusBilling.Обновить();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Элемент.ТекущиеДанные.ManualAdjustment Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура LawsonBillingПередНачаломИзменения(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура HOBBillingПередНачаломИзменения(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура OracleMIBillingПередНачаломИзменения(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура OracleSmithBillingПередНачаломИзменения(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура RadiusBillingПередНачаломИзменения(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура RadiusBillingПередУдалением(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура OracleSmithBillingПередУдалением(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура OracleMIBillingПередУдалением(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура HOBBillingПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПриНачалеРедактированияСтрокиБиллинга(Элемент, НоваяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура OracleMIBillingПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПриНачалеРедактированияСтрокиБиллинга(Элемент, НоваяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура OracleSmithBillingПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПриНачалеРедактированияСтрокиБиллинга(Элемент, НоваяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура RadiusBillingПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПриНачалеРедактированияСтрокиБиллинга(Элемент, НоваяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура HOBBillingПередУдалением(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура LawsonBillingПередУдалением(Элемент, Отказ)
	ПроверитьДоступностьСтрокиТЧБиллингаДляРедактирования(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	ОткрытьФорму("РегистрСведений.НастройкиРасчетаБиллинга.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура LawsonBillingПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПриНачалеРедактированияСтрокиБиллинга(Элемент, НоваяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПриНачалеРедактированияСтрокиБиллинга(Элемент, НоваяСтрока)
	
	Если НоваяСтрока И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.ManualAdjustment = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ЗагрузитьПодготовленныеДанные();
				//Прочитать();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции
